[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=4
width=416
height=416
# width=480 #######################################
# height=480 ########################################
channels=3
momentum=0.9
decay=0.0005
angle=0
# saturation = 1.5
# exposure = 1.5
# hue=.1
saturation=1.1  # Keep original saturation
exposure=1.1  # Keep original exposure
hue=0.05  # Turn off hue shift since color pattern matters
# saturation=1.5  # Keep original saturation
# exposure=1.5  # Keep original exposure
# hue=0.05  # Turn off hue shift since color pattern matters
# saturation=1.0  # Keep original saturation
# exposure=1.5  # Keep original exposure
# hue=0  # Turn off hue shift since color pattern matters

learning_rate=0.005
burn_in=1000
max_batches=6000
policy=steps
steps=4200,5400
scales=.1,.1

mosaic=1 ##########################
mosaic_bound=1 ##########################
# gaussian_noise=1 ############################

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[route]
layers = -1,-2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -6,-1

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[route]
layers = -1,-2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -6,-1

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[route]
layers = -1,-2

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -6,-1

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

##################################

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters =18
activation=linear



[yolo]
mask = 6,7,8
anchors =  27, 18,  25, 27,  24, 29,  27, 28,  26, 30,  24, 32,  96, 65,  98,104,  96,113
classes=1
# counters_per_class = 3348, 1720, 1141
num=9
jitter=.3
scale_x_y = 1.05
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
ignore_thresh = .7
truth_thresh = 1
# nms_thresh = 0.3 #####
random=0
resize=1.5
nms_kind=greedynms
beta_nms=0.6
# nms_kind=softnms
# beta_nms=0.9
# nms_kind=diounms
# beta_nms=1.2
focal_loss=1 ##############################

[route]
layers = -4

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 23

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters =18
activation=linear

[yolo]
mask = 3,4,5
anchors =  27, 18,  25, 27,  24, 29,  27, 28,  26, 30,  24, 32,  96, 65,  98,104,  96,113
classes=1
# counters_per_class = 3348, 1720, 1141
num=9
jitter=.3
scale_x_y = 1.05
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
ignore_thresh = .7
truth_thresh = 1
# nms_thresh = 0.3 #####
random=0
resize=1.5
nms_kind=greedynms
beta_nms=0.6
# nms_kind=softnms
# beta_nms=0.9
# nms_kind=diounms
# beta_nms=1.2
focal_loss=1 ##############################

[route]
layers = -3

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 15

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters =18
activation=linear

[yolo]
mask = 0,1,2
anchors =  27, 18,  25, 27,  24, 29,  27, 28,  26, 30,  24, 32,  96, 65,  98,104,  96,113
classes=1
# counters_per_class = 3348, 1720, 1141
num=9
jitter=.3
scale_x_y = 1.05
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
ignore_thresh = .7
truth_thresh = 1
# nms_thresh = 0.3 #####
random=0
resize=1.5
nms_kind=greedynms
beta_nms=0.6
# nms_kind=softnms
# beta_nms=0.9
# nms_kind=diounms
# beta_nms=1.2
focal_loss=1 ##############################
